Examinator/src/InformationRegisters/ЗаявкиНаОбучениеСУО/ЗаявкиНаОбучениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаявкиНаОбучениеСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЗаявки</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
      <types>CatalogRef.КаталогПрограммОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредметЗаявки</name>
    <type>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Documents/ПрохождениеОбученияСУО/ПрохождениеОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрохождениеОбученияСУО</name>
  <registerRecords>InformationRegister.РасписаниеОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ФайлыНаПроверкуПреподавателюСУО</registerRecords>
  <registerRecords>InformationRegister.УчастникиОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ОценкиКачестваОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.ПрохожденияОбученияСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПрохождение</name>
    <type>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращеноНаДоработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаКачестваОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКачестваОбучения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОцениванияКачестваОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставленаОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/CommonModules/ОбучениеСУОВызовСервера/Module.bsl
Функция ОписаниеЕдинственногоЗаданияПрохождения(ПрохождениеОбучения) Экспорт
	Возврат Документы.ПрохождениеОбученияСУО.ОписаниеЕдинственногоЗаданияПрохождения(ПрохождениеОбучения);
КонецФункции

Функция ОписаниеЕдинственногоЗаданияОбучения(ПроведениеОбучения) Экспорт
	Возврат Документы.ПроведениеОбученияСУО.ОписаниеЕдинственногоЗаданияОбучения(ПроведениеОбучения);
КонецФункции

Функция ЗаявкаНаОбучениеПользователя(Знач ПредметЗаявки, Знач Пользователь) Экспорт
	Возврат РегистрыСведений.ЗаявкиНаОбучениеСУО.Заявка(ПредметЗаявки, Пользователь);		
КонецФункции

Функция ЗаписатьПользователяНаОткрытоеОбучение(Знач ПроведениеОбучения, Знач Пользователь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);	
		
	Возврат ОбучениеСУО.ЗаписатьПользователяНаОткрытоеОбучение(ПроведениеОбучения, Пользователь);
	
КонецФункции
